#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.iam.azurerm_role_assignment.cosmos_admins["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"] will be created
  + resource "azurerm_role_assignment" "cosmos_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "00000000-0000-0000-0000-000000000002"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.azurerm_role_assignment.cosmos_admins["32544b2f-b97d-4453-9555-1ad71630512c"] will be created
  + resource "azurerm_role_assignment" "cosmos_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "00000000-0000-0000-0000-000000000002"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_apps.module.function_app_user.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "EntityConfigurationStorageAccountConnectionString" = "\"DefaultEndpointsProtocol=https;AccountName=scirulli;AccountKey=eDaKGRCEL+w1UqWoOa2ZmKBa1HXB6+UCq3Uwst+lT7d1pxj1X2SGnHOBLSmYHqcYKJ9fvVZnJMMJ+AStppZ/Zw==;EndpointSuffix=core.windows.net\"" -> null
          - "EntityConfigurationStorageContainerName"           = "cached" -> null
          ~ "GoogleAppCredentialsEncoded"                       = "foo" -> "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=GoogleAppCredentialsEncoded)"
          ~ "PdvTokenizerApiKey"                                = "foo" -> "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=PdvTokenizerApiKey)"
          ~ "WalletKeys"                                        = "W3sicCI6ImZvbyIsImt0eSI6IlJTQSIsInEiOiJmb28iLCJkIjoiZm9vIiwiZSI6IkFRQUIiLCJ1c2UiOiJzaWciLCJraWQiOiI3TG1CeUdUOHozSlBnUmZ6NlB3dmxjdFdfeDdVRUN4Q3Fod0pfYmpuM0V3IiwicWkiOiJmb28iLCJkcCI6ImZvbyIsImFsZyI6IlJTMjU2IiwiZHEiOiJmb28iLCJuIjoiZm9vIn0seyJrdHkiOiJFQyIsImQiOiJmb28iLCJ1c2UiOiJzaWciLCJjcnYiOiJQLTI1NiIsImtpZCI6ImZvbyIsIngiOiJmb28iLCJ5IjoiZm9vIn1d" -> "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=WalletKeys)"
            # (33 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-01"
        name                                           = "io-p-itn-wallet-user-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
